app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "request", "massage", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@contact = Contact.new(contact_params)
		name = params[:contact][:name]
		email = params[:contact][:email]
		request = params[:contact][:request]
		massage = params[:contact][:massage]

		ContactMailer.contact_email(name, email, request, massage).deliver

		if @contact.save